[Killed] StringLiteral
src/App.jsx:7:40
 
 function App() {
   // State storing the current value of the calculation
-  const [result, setResult] = useState('');
+  const [result, setResult] = useState("Stryker was here!");
 
   // Modify state with the new input
killedBy: App should calculate correctly should perform addition correctly
statusReason: expected 'Error' to deeply equal '5'

[Killed] BlockStatement
src/App.jsx:10:34
   const [result, setResult] = useState('');
 
   // Modify state with the new input
-  const handleClick = (value) => {
-    setResult(result + value);
-  };
+  const handleClick = (value) => {};
 
   // Evaluate current state
killedBy: App should calculate correctly should perform addition correctly
statusReason: expected '0' to deeply equal '5'

[Killed] ArithmeticOperator
src/App.jsx:11:15
 
   // Modify state with the new input
   const handleClick = (value) => {
-    setResult(result + value);
+    setResult(result - value);
   };
 
killedBy: App should calculate correctly should perform addition correctly
statusReason: expected 'Error' to deeply equal '5'

[Killed] BlockStatement
src/App.jsx:15:33
   };
 
   // Evaluate current state
-  const calculateResult = () => {
-    try {
-      // Attempt to parse a result from the current string
-      setResult(evalFunction(result).toString());
-    } catch (error) {
-      setResult('Error');
-    }
-  };
+  const calculateResult = () => {};
 
   // Clear state
killedBy: App should calculate correctly should perform addition correctly
statusReason: expected '2+3' to deeply equal '5'

[Killed] BlockStatement
src/App.jsx:16:9
 
   // Evaluate current state
   const calculateResult = () => {
-    try {
-      // Attempt to parse a result from the current string
-      setResult(evalFunction(result).toString());
-    } catch (error) {
+    try {} catch (error) {
       setResult('Error');
     }
killedBy: App should calculate correctly should perform addition correctly
statusReason: expected '2+3' to deeply equal '5'

[NoCoverage] BlockStatement
src/App.jsx:19:21
     try {
       // Attempt to parse a result from the current string
       setResult(evalFunction(result).toString());
-    } catch (error) {
-      setResult('Error');
-    }
+    } catch (error) {}
   };
 

[NoCoverage] StringLiteral
src/App.jsx:20:17
       // Attempt to parse a result from the current string
       setResult(evalFunction(result).toString());
     } catch (error) {
-      setResult('Error');
+      setResult("");
     }
   };

[NoCoverage] BlockStatement
src/App.jsx:25:29
   };
 
   // Clear state
-  const clearResult = () => {
-    setResult('');
-  };
+  const clearResult = () => {};
 
   return (

[NoCoverage] StringLiteral
src/App.jsx:26:15
 
   // Clear state
   const clearResult = () => {
-    setResult('');
+    setResult("Stryker was here!");
   };
 

[Killed] LogicalOperator
src/App.jsx:31:48
 
   return (
     <div className="calculator">
-      <div className="display" role="display">{result || '0'}</div>
+      <div className="display" role="display">{result && '0'}</div>
       <div className="buttons">
         <button onClick={() => handleClick('7')}>7</button>
killedBy: App should calculate correctly should perform addition correctly
statusReason: expected '0' to deeply equal '5'

[Killed] ConditionalExpression
src/App.jsx:31:48
 
   return (
     <div className="calculator">
-      <div className="display" role="display">{result || '0'}</div>
+      <div className="display" role="display">{false}</div>
       <div className="buttons">
         <button onClick={() => handleClick('7')}>7</button>
killedBy: App should calculate correctly should perform addition correctly
statusReason: expected '' to deeply equal '5'

[Survived] ArrowFunction
src/App.jsx:33:26
     <div className="calculator">
       <div className="display" role="display">{result || '0'}</div>
       <div className="buttons">
-        <button onClick={() => handleClick('7')}>7</button>
+        <button onClick={() => undefined}>7</button>
         <button onClick={() => handleClick('8')}>8</button>
         <button onClick={() => handleClick('9')}>9</button>

[Killed] ArrowFunction
src/App.jsx:34:26
       <div className="display" role="display">{result || '0'}</div>
       <div className="buttons">
         <button onClick={() => handleClick('7')}>7</button>
-        <button onClick={() => handleClick('8')}>8</button>
+        <button onClick={() => undefined}>8</button>
         <button onClick={() => handleClick('9')}>9</button>
         <button onClick={() => handleClick('+')}>+</button>
killedBy: App should calculate correctly should perform subtraction correctly
statusReason: expected 'Error' to deeply equal '6'

[Survived] ArrowFunction
src/App.jsx:35:26
       <div className="buttons">
         <button onClick={() => handleClick('7')}>7</button>
         <button onClick={() => handleClick('8')}>8</button>
-        <button onClick={() => handleClick('9')}>9</button>
+        <button onClick={() => undefined}>9</button>
         <button onClick={() => handleClick('+')}>+</button>
         <button onClick={() => handleClick('4')}>4</button>

[NoCoverage] StringLiteral
src/App.jsx:35:44
       <div className="buttons">
         <button onClick={() => handleClick('7')}>7</button>
         <button onClick={() => handleClick('8')}>8</button>
-        <button onClick={() => handleClick('9')}>9</button>
+        <button onClick={() => handleClick("")}>9</button>
         <button onClick={() => handleClick('+')}>+</button>
         <button onClick={() => handleClick('4')}>4</button>

[Killed] ArrowFunction
src/App.jsx:36:26
         <button onClick={() => handleClick('7')}>7</button>
         <button onClick={() => handleClick('8')}>8</button>
         <button onClick={() => handleClick('9')}>9</button>
-        <button onClick={() => handleClick('+')}>+</button>
+        <button onClick={() => undefined}>+</button>
         <button onClick={() => handleClick('4')}>4</button>
         <button onClick={() => handleClick('5')}>5</button>
killedBy: App should calculate correctly should perform addition correctly
statusReason: expected '23' to deeply equal '5'

[Survived] ArrowFunction
src/App.jsx:37:26
         <button onClick={() => handleClick('8')}>8</button>
         <button onClick={() => handleClick('9')}>9</button>
         <button onClick={() => handleClick('+')}>+</button>
-        <button onClick={() => handleClick('4')}>4</button>
+        <button onClick={() => undefined}>4</button>
         <button onClick={() => handleClick('5')}>5</button>
         <button onClick={() => handleClick('6')}>6</button>

[NoCoverage] StringLiteral
src/App.jsx:37:44
         <button onClick={() => handleClick('8')}>8</button>
         <button onClick={() => handleClick('9')}>9</button>
         <button onClick={() => handleClick('+')}>+</button>
-        <button onClick={() => handleClick('4')}>4</button>
+        <button onClick={() => handleClick("")}>4</button>
         <button onClick={() => handleClick('5')}>5</button>
         <button onClick={() => handleClick('6')}>6</button>

[Survived] ArrowFunction
src/App.jsx:38:26
         <button onClick={() => handleClick('9')}>9</button>
         <button onClick={() => handleClick('+')}>+</button>
         <button onClick={() => handleClick('4')}>4</button>
-        <button onClick={() => handleClick('5')}>5</button>
+        <button onClick={() => undefined}>5</button>
         <button onClick={() => handleClick('6')}>6</button>
         <button onClick={() => handleClick('-')}>-</button>

[NoCoverage] StringLiteral
src/App.jsx:38:44
         <button onClick={() => handleClick('9')}>9</button>
         <button onClick={() => handleClick('+')}>+</button>
         <button onClick={() => handleClick('4')}>4</button>
-        <button onClick={() => handleClick('5')}>5</button>
+        <button onClick={() => handleClick("")}>5</button>
         <button onClick={() => handleClick('6')}>6</button>
         <button onClick={() => handleClick('-')}>-</button>

[Survived] ArrowFunction
src/App.jsx:39:26
         <button onClick={() => handleClick('+')}>+</button>
         <button onClick={() => handleClick('4')}>4</button>
         <button onClick={() => handleClick('5')}>5</button>
-        <button onClick={() => handleClick('6')}>6</button>
+        <button onClick={() => undefined}>6</button>
         <button onClick={() => handleClick('-')}>-</button>
         <button onClick={() => handleClick('1')}>1</button>

[Killed] ArrowFunction
src/App.jsx:40:26
         <button onClick={() => handleClick('4')}>4</button>
         <button onClick={() => handleClick('5')}>5</button>
         <button onClick={() => handleClick('6')}>6</button>
-        <button onClick={() => handleClick('-')}>-</button>
+        <button onClick={() => undefined}>-</button>
         <button onClick={() => handleClick('1')}>1</button>
         <button onClick={() => handleClick('2')}>2</button>
killedBy: App should calculate correctly should perform subtraction correctly
statusReason: expected '82' to deeply equal '6'

[Survived] ArrowFunction
src/App.jsx:41:26
         <button onClick={() => handleClick('5')}>5</button>
         <button onClick={() => handleClick('6')}>6</button>
         <button onClick={() => handleClick('-')}>-</button>
-        <button onClick={() => handleClick('1')}>1</button>
+        <button onClick={() => undefined}>1</button>
         <button onClick={() => handleClick('2')}>2</button>
         <button onClick={() => handleClick('3')}>3</button>

[Killed] ArrowFunction
src/App.jsx:42:26
         <button onClick={() => handleClick('6')}>6</button>
         <button onClick={() => handleClick('-')}>-</button>
         <button onClick={() => handleClick('1')}>1</button>
-        <button onClick={() => handleClick('2')}>2</button>
+        <button onClick={() => undefined}>2</button>
         <button onClick={() => handleClick('3')}>3</button>
         <button onClick={() => handleClick('*')}>*</button>
killedBy: App should calculate correctly should perform addition correctly
statusReason: expected 'Error' to deeply equal '5'

[Killed] ArrowFunction
src/App.jsx:43:26
         <button onClick={() => handleClick('-')}>-</button>
         <button onClick={() => handleClick('1')}>1</button>
         <button onClick={() => handleClick('2')}>2</button>
-        <button onClick={() => handleClick('3')}>3</button>
+        <button onClick={() => undefined}>3</button>
         <button onClick={() => handleClick('*')}>*</button>
         <button onClick={() => handleClick('0')}>0</button>
killedBy: App should calculate correctly should perform addition correctly
statusReason: expected 'Error' to deeply equal '5'

[Survived] ArrowFunction
src/App.jsx:44:26
         <button onClick={() => handleClick('1')}>1</button>
         <button onClick={() => handleClick('2')}>2</button>
         <button onClick={() => handleClick('3')}>3</button>
-        <button onClick={() => handleClick('*')}>*</button>
+        <button onClick={() => undefined}>*</button>
         <button onClick={() => handleClick('0')}>0</button>
         <button onClick={() => handleClick('.')}>.</button>

[Survived] ArrowFunction
src/App.jsx:45:26
         <button onClick={() => handleClick('2')}>2</button>
         <button onClick={() => handleClick('3')}>3</button>
         <button onClick={() => handleClick('*')}>*</button>
-        <button onClick={() => handleClick('0')}>0</button>
+        <button onClick={() => undefined}>0</button>
         <button onClick={() => handleClick('.')}>.</button>
         <button onClick={calculateResult}>=</button>

[Survived] ArrowFunction
src/App.jsx:46:26
         <button onClick={() => handleClick('3')}>3</button>
         <button onClick={() => handleClick('*')}>*</button>
         <button onClick={() => handleClick('0')}>0</button>
-        <button onClick={() => handleClick('.')}>.</button>
+        <button onClick={() => undefined}>.</button>
         <button onClick={calculateResult}>=</button>
         <button onClick={() => handleClick('/')}>/</button>

[Survived] ArrowFunction
src/App.jsx:48:26
         <button onClick={() => handleClick('0')}>0</button>
         <button onClick={() => handleClick('.')}>.</button>
         <button onClick={calculateResult}>=</button>
-        <button onClick={() => handleClick('/')}>/</button>
+        <button onClick={() => undefined}>/</button>
         <button onClick={clearResult}>C</button>
       </div>    
