[Killed] BlockStatement
src/helpers/CalculatorOperationClasses.tsx:8:36
  */
 export function evalFunction(functionString: string): number | string {
     // If nothing has been entered, no need to error or evaluate, just return 0
-    if(functionString.length == 0) {
-        return 0;
-    }
+    if(functionString.length == 0) {}
 
     // Ensure that the function starts with a number
killedBy: CalculatorHelper should handle error cases correctly should return 0 when evaluating empty string
statusReason: expected 'Error' to deeply equal +0

[Killed] EqualityOperator
src/helpers/CalculatorOperationClasses.tsx:8:8
  */
 export function evalFunction(functionString: string): number | string {
     // If nothing has been entered, no need to error or evaluate, just return 0
-    if(functionString.length == 0) {
+    if(functionString.length != 0) {
         return 0;
     }
killedBy: CalculatorHelper should do basic calculations correctly should return the calculated number for valid operator with function '1'
statusReason: expected +0 to deeply equal 1

[Killed] ConditionalExpression
src/helpers/CalculatorOperationClasses.tsx:13:8
     }
 
     // Ensure that the function starts with a number
-    if(!functionString.match(/^[0-9]/) || !functionString.match(/[0-9]$/)) {
+    if(true) {
         // Return 'Error' so that the user can't attempt to evaluate a function starting with an operator
         return 'Error';
killedBy: CalculatorHelper should do basic calculations correctly should return the calculated number for valid operator with function '0'
statusReason: expected 'Error' to deeply equal +0

[Killed] BooleanLiteral
src/helpers/CalculatorOperationClasses.tsx:13:8
     }
 
     // Ensure that the function starts with a number
-    if(!functionString.match(/^[0-9]/) || !functionString.match(/[0-9]$/)) {
+    if(functionString.match(/^[0-9]/) || !functionString.match(/[0-9]$/)) {
         // Return 'Error' so that the user can't attempt to evaluate a function starting with an operator
         return 'Error';
killedBy: CalculatorHelper should do basic calculations correctly should return the calculated number for valid operator with function '0'
statusReason: expected 'Error' to deeply equal +0

[Killed] EqualityOperator
src/helpers/CalculatorOperationClasses.tsx:20:11
 
     // Must evaluate in PEMDAS order
     // Find all occurances of multiplicaton, evaluate them, then update the function
-    while(functionString.match(/[0-9]+\.?[0-9]*\*[0-9]+\.?[0-9]*/) !== null) {
+    while(functionString.match(/[0-9]+\.?[0-9]*\*[0-9]+\.?[0-9]*/) === null) {
         let multAppearance = functionString.match(/[0-9]+\.?[0-9]*\*[0-9]+\.?[0-9]*/)![0];
         // Every matching appearance will be of the form {NUMBER}*{NUMBER} meaning splitting it by '*' will always result in the needed operators
killedBy: CalculatorHelper should do basic calculations correctly should return the calculated number for valid operator with function '0'
statusReason: Cannot read properties of null (reading '0')

[Killed] ConditionalExpression
src/helpers/CalculatorOperationClasses.tsx:20:11
 
     // Must evaluate in PEMDAS order
     // Find all occurances of multiplicaton, evaluate them, then update the function
-    while(functionString.match(/[0-9]+\.?[0-9]*\*[0-9]+\.?[0-9]*/) !== null) {
+    while(false) {
         let multAppearance = functionString.match(/[0-9]+\.?[0-9]*\*[0-9]+\.?[0-9]*/)![0];
         // Every matching appearance will be of the form {NUMBER}*{NUMBER} meaning splitting it by '*' will always result in the needed operators
killedBy: CalculatorHelper should do basic calculations correctly should return the calculated number for valid operator with function '5*2'
statusReason: expected 'Error' to deeply equal 10

[Killed] Regex
src/helpers/CalculatorOperationClasses.tsx:21:51
     // Must evaluate in PEMDAS order
     // Find all occurances of multiplicaton, evaluate them, then update the function
     while(functionString.match(/[0-9]+\.?[0-9]*\*[0-9]+\.?[0-9]*/) !== null) {
-        let multAppearance = functionString.match(/[0-9]+\.?[0-9]*\*[0-9]+\.?[0-9]*/)![0];
+        let multAppearance = functionString.match(/[0-9]+\.?[0-9]*\*[0-9]+\.?[^0-9]*/)![0];
         // Every matching appearance will be of the form {NUMBER}*{NUMBER} meaning splitting it by '*' will always result in the needed operators
         let operators = multAppearance.split('*');
killedBy: CalculatorHelper should do basic calculations correctly should return the calculated number for valid operator with function '5.7*6.8'
statusReason: expected 34.28 to deeply equal 38.76

[Killed] Regex
src/helpers/CalculatorOperationClasses.tsx:21:51
     // Must evaluate in PEMDAS order
     // Find all occurances of multiplicaton, evaluate them, then update the function
     while(functionString.match(/[0-9]+\.?[0-9]*\*[0-9]+\.?[0-9]*/) !== null) {
-        let multAppearance = functionString.match(/[0-9]+\.?[0-9]*\*[0-9]+\.?[0-9]*/)![0];
+        let multAppearance = functionString.match(/[0-9]+\.?[0-9]\*[0-9]+\.?[0-9]*/)![0];
         // Every matching appearance will be of the form {NUMBER}*{NUMBER} meaning splitting it by '*' will always result in the needed operators
         let operators = multAppearance.split('*');
killedBy: CalculatorHelper should do basic calculations correctly should return the calculated number for valid operator with function '5*2'
statusReason: Cannot read properties of null (reading '0')

[Killed] UnaryOperator
src/helpers/CalculatorOperationClasses.tsx:24:49
         let multAppearance = functionString.match(/[0-9]+\.?[0-9]*\*[0-9]+\.?[0-9]*/)![0];
         // Every matching appearance will be of the form {NUMBER}*{NUMBER} meaning splitting it by '*' will always result in the needed operators
         let operators = multAppearance.split('*');
-        let result: number = (+operators[0]) * (+operators[1]);
+        let result: number = (+operators[0]) * (-operators[1]);
         functionString = functionString.replace(multAppearance, result.toString());
     }
killedBy: CalculatorHelper should do basic calculations correctly should return the calculated number for valid operator with function '5*2'
statusReason: expected -10 to deeply equal 10

[Killed] UnaryOperator
src/helpers/CalculatorOperationClasses.tsx:24:31
         let multAppearance = functionString.match(/[0-9]+\.?[0-9]*\*[0-9]+\.?[0-9]*/)![0];
         // Every matching appearance will be of the form {NUMBER}*{NUMBER} meaning splitting it by '*' will always result in the needed operators
         let operators = multAppearance.split('*');
-        let result: number = (+operators[0]) * (+operators[1]);
+        let result: number = (-operators[0]) * (+operators[1]);
         functionString = functionString.replace(multAppearance, result.toString());
     }
killedBy: CalculatorHelper should do basic calculations correctly should return the calculated number for valid operator with function '5*2'
statusReason: expected -10 to deeply equal 10

[Killed] ConditionalExpression
src/helpers/CalculatorOperationClasses.tsx:29:11
     }
 
     // Find all occurances of division, evaluate them, then update the function
-    while(functionString.match(/[0-9]+\.?[0-9]*\/[0-9]+\.?[0-9]*/) !== null) {
+    while(false) {
         let divAppearance = functionString.match(/[0-9]+\.?[0-9]*\/[0-9]+\.?[0-9]*/)![0];
         // Every matching appearance will be of the form {NUMBER}/{NUMBER} meaning splitting it by '/' will always result in the needed operators
killedBy: CalculatorHelper should do basic calculations correctly should return the calculated number for valid operator with function '5/2'
statusReason: expected 'Error' to deeply equal 2.5

[Killed] EqualityOperator
src/helpers/CalculatorOperationClasses.tsx:29:11
     }
 
     // Find all occurances of division, evaluate them, then update the function
-    while(functionString.match(/[0-9]+\.?[0-9]*\/[0-9]+\.?[0-9]*/) !== null) {
+    while(functionString.match(/[0-9]+\.?[0-9]*\/[0-9]+\.?[0-9]*/) === null) {
         let divAppearance = functionString.match(/[0-9]+\.?[0-9]*\/[0-9]+\.?[0-9]*/)![0];
         // Every matching appearance will be of the form {NUMBER}/{NUMBER} meaning splitting it by '/' will always result in the needed operators
killedBy: App should calculate correctly should perform addition correctly
statusReason: expected 'Error' to deeply equal '5'

[Killed] Regex
src/helpers/CalculatorOperationClasses.tsx:30:50
 
     // Find all occurances of division, evaluate them, then update the function
     while(functionString.match(/[0-9]+\.?[0-9]*\/[0-9]+\.?[0-9]*/) !== null) {
-        let divAppearance = functionString.match(/[0-9]+\.?[0-9]*\/[0-9]+\.?[0-9]*/)![0];
+        let divAppearance = functionString.match(/[0-9]+\.?[0-9]*\/[0-9]+\.[0-9]*/)![0];
         // Every matching appearance will be of the form {NUMBER}/{NUMBER} meaning splitting it by '/' will always result in the needed operators
         let operators = divAppearance.split('/');
killedBy: CalculatorHelper should do basic calculations correctly should return the calculated number for valid operator with function '5/2'
statusReason: Cannot read properties of null (reading '0')

[Killed] Regex
src/helpers/CalculatorOperationClasses.tsx:30:50
 
     // Find all occurances of division, evaluate them, then update the function
     while(functionString.match(/[0-9]+\.?[0-9]*\/[0-9]+\.?[0-9]*/) !== null) {
-        let divAppearance = functionString.match(/[0-9]+\.?[0-9]*\/[0-9]+\.?[0-9]*/)![0];
+        let divAppearance = functionString.match(/[0-9]+\.?[0-9]*\/[^0-9]+\.?[0-9]*/)![0];
         // Every matching appearance will be of the form {NUMBER}/{NUMBER} meaning splitting it by '/' will always result in the needed operators
         let operators = divAppearance.split('/');
killedBy: CalculatorHelper should do basic calculations correctly should return the calculated number for valid operator with function '5/2'
statusReason: Cannot read properties of null (reading '0')

[Killed] StringLiteral
src/helpers/CalculatorOperationClasses.tsx:32:45
     while(functionString.match(/[0-9]+\.?[0-9]*\/[0-9]+\.?[0-9]*/) !== null) {
         let divAppearance = functionString.match(/[0-9]+\.?[0-9]*\/[0-9]+\.?[0-9]*/)![0];
         // Every matching appearance will be of the form {NUMBER}/{NUMBER} meaning splitting it by '/' will always result in the needed operators
-        let operators = divAppearance.split('/');
+        let operators = divAppearance.split("");
         if(operators[1] == '0') {
             return 'Div By 0 Error';
killedBy: CalculatorHelper should do basic calculations correctly should return the calculated number for valid operator with function '5/2'
statusReason: expected 'Error' to deeply equal 2.5

[Killed] BlockStatement
src/helpers/CalculatorOperationClasses.tsx:33:33
         let divAppearance = functionString.match(/[0-9]+\.?[0-9]*\/[0-9]+\.?[0-9]*/)![0];
         // Every matching appearance will be of the form {NUMBER}/{NUMBER} meaning splitting it by '/' will always result in the needed operators
         let operators = divAppearance.split('/');
-        if(operators[1] == '0') {
-            return 'Div By 0 Error';
-        }
+        if(operators[1] == '0') {}
         let result: number = (+operators[0]) / (+operators[1]);
         functionString = functionString.replace(divAppearance, result.toString());
killedBy: CalculatorHelper should handle error cases correctly should return Div By 0 Error when Div By 0
statusReason: expected Infinity to deeply equal 'Div By 0 Error'

[Killed] ConditionalExpression
src/helpers/CalculatorOperationClasses.tsx:33:12
         let divAppearance = functionString.match(/[0-9]+\.?[0-9]*\/[0-9]+\.?[0-9]*/)![0];
         // Every matching appearance will be of the form {NUMBER}/{NUMBER} meaning splitting it by '/' will always result in the needed operators
         let operators = divAppearance.split('/');
-        if(operators[1] == '0') {
+        if(true) {
             return 'Div By 0 Error';
         }
killedBy: CalculatorHelper should do basic calculations correctly should return the calculated number for valid operator with function '5/2'
statusReason: expected 'Div By 0 Error' to deeply equal 2.5

[Killed] StringLiteral
src/helpers/CalculatorOperationClasses.tsx:34:20
         // Every matching appearance will be of the form {NUMBER}/{NUMBER} meaning splitting it by '/' will always result in the needed operators
         let operators = divAppearance.split('/');
         if(operators[1] == '0') {
-            return 'Div By 0 Error';
+            return "";
         }
         let result: number = (+operators[0]) / (+operators[1]);
killedBy: CalculatorHelper should handle error cases correctly should return Div By 0 Error when Div By 0
statusReason: expected '' to deeply equal 'Div By 0 Error'

[Killed] UnaryOperator
src/helpers/CalculatorOperationClasses.tsx:36:49
         if(operators[1] == '0') {
             return 'Div By 0 Error';
         }
-        let result: number = (+operators[0]) / (+operators[1]);
+        let result: number = (+operators[0]) / (-operators[1]);
         functionString = functionString.replace(divAppearance, result.toString());
     }
killedBy: CalculatorHelper should do basic calculations correctly should return the calculated number for valid operator with function '5/2'
statusReason: expected -2.5 to deeply equal 2.5

[Killed] UnaryOperator
src/helpers/CalculatorOperationClasses.tsx:36:31
         if(operators[1] == '0') {
             return 'Div By 0 Error';
         }
-        let result: number = (+operators[0]) / (+operators[1]);
+        let result: number = (-operators[0]) / (+operators[1]);
         functionString = functionString.replace(divAppearance, result.toString());
     }
killedBy: CalculatorHelper should do basic calculations correctly should return the calculated number for valid operator with function '5/2'
statusReason: expected -2.5 to deeply equal 2.5

[Killed] ConditionalExpression
src/helpers/CalculatorOperationClasses.tsx:41:11
     }
 
     // Find all occurances of addition, evaluate them, then update the function
-    while(functionString.match(/[0-9]+\.?[0-9]*\+[0-9]+\.?[0-9]*/) !== null) {
+    while(false) {
         let addAppearance = functionString.match(/[0-9]+\.?[0-9]*\+[0-9]+\.?[0-9]*/)![0];
         // Every matching appearance will be of the form {NUMBER}+{NUMBER} meaning splitting it by '+' will always result in the needed operators
killedBy: CalculatorHelper should do basic calculations correctly should return the calculated number for valid operator with function '5+2'
statusReason: expected 'Error' to deeply equal 7

[Killed] EqualityOperator
src/helpers/CalculatorOperationClasses.tsx:41:11
     }
 
     // Find all occurances of addition, evaluate them, then update the function
-    while(functionString.match(/[0-9]+\.?[0-9]*\+[0-9]+\.?[0-9]*/) !== null) {
+    while(functionString.match(/[0-9]+\.?[0-9]*\+[0-9]+\.?[0-9]*/) === null) {
         let addAppearance = functionString.match(/[0-9]+\.?[0-9]*\+[0-9]+\.?[0-9]*/)![0];
         // Every matching appearance will be of the form {NUMBER}+{NUMBER} meaning splitting it by '+' will always result in the needed operators
killedBy: CalculatorHelper should do basic calculations correctly should return the calculated number for valid operator with function '0'
statusReason: Cannot read properties of null (reading '0')

[Killed] Regex
src/helpers/CalculatorOperationClasses.tsx:42:50
 
     // Find all occurances of addition, evaluate them, then update the function
     while(functionString.match(/[0-9]+\.?[0-9]*\+[0-9]+\.?[0-9]*/) !== null) {
-        let addAppearance = functionString.match(/[0-9]+\.?[0-9]*\+[0-9]+\.?[0-9]*/)![0];
+        let addAppearance = functionString.match(/[0-9]+\.?[0-9]*\+[0-9]+\.?[0-9]/)![0];
         // Every matching appearance will be of the form {NUMBER}+{NUMBER} meaning splitting it by '+' will always result in the needed operators
         let operators = addAppearance.split('+');
killedBy: CalculatorHelper should do basic calculations correctly should return the calculated number for valid operator with function '5+2'
statusReason: Cannot read properties of null (reading '0')

[Killed] StringLiteral
src/helpers/CalculatorOperationClasses.tsx:44:45
     while(functionString.match(/[0-9]+\.?[0-9]*\+[0-9]+\.?[0-9]*/) !== null) {
         let addAppearance = functionString.match(/[0-9]+\.?[0-9]*\+[0-9]+\.?[0-9]*/)![0];
         // Every matching appearance will be of the form {NUMBER}+{NUMBER} meaning splitting it by '+' will always result in the needed operators
-        let operators = addAppearance.split('+');
+        let operators = addAppearance.split("");
         let result: number = (+operators[0]) + (+operators[1]);
         functionString = functionString.replace(addAppearance, result.toString());
killedBy: App should calculate correctly should perform addition correctly
statusReason: expected 'Error' to deeply equal '5'

[Killed] UnaryOperator
src/helpers/CalculatorOperationClasses.tsx:45:31
         let addAppearance = functionString.match(/[0-9]+\.?[0-9]*\+[0-9]+\.?[0-9]*/)![0];
         // Every matching appearance will be of the form {NUMBER}+{NUMBER} meaning splitting it by '+' will always result in the needed operators
         let operators = addAppearance.split('+');
-        let result: number = (+operators[0]) + (+operators[1]);
+        let result: number = (-operators[0]) + (+operators[1]);
         functionString = functionString.replace(addAppearance, result.toString());
     }
killedBy: CalculatorHelper should do basic calculations correctly should return the calculated number for valid operator with function '5+2'
statusReason: expected -3 to deeply equal 7

[Killed] UnaryOperator
src/helpers/CalculatorOperationClasses.tsx:45:49
         let addAppearance = functionString.match(/[0-9]+\.?[0-9]*\+[0-9]+\.?[0-9]*/)![0];
         // Every matching appearance will be of the form {NUMBER}+{NUMBER} meaning splitting it by '+' will always result in the needed operators
         let operators = addAppearance.split('+');
-        let result: number = (+operators[0]) + (+operators[1]);
+        let result: number = (+operators[0]) + (-operators[1]);
         functionString = functionString.replace(addAppearance, result.toString());
     }
killedBy: CalculatorHelper should do basic calculations correctly should return the calculated number for valid operator with function '5+2'
statusReason: expected 3 to deeply equal 7

[Killed] EqualityOperator
src/helpers/CalculatorOperationClasses.tsx:50:11
     }
 
     // Find all occurances of subtraction, evaluate them, then update the function
-    while(functionString.match(/\-?[0-9]+\.?[0-9]*\-\-?[0-9]+\.?[0-9]*/) !== null) {
+    while(functionString.match(/\-?[0-9]+\.?[0-9]*\-\-?[0-9]+\.?[0-9]*/) === null) {
         // Notice that because we are dealing with subtraction now, the result could be negative. We must handle that in the Regex
         let subAppearance = functionString.match(/\-?[0-9]+\.?[0-9]*\-\-?[0-9]+\.?[0-9]*/)![0];
killedBy: CalculatorHelper should do basic calculations correctly should return the calculated number for valid operator with function '0'
statusReason: Cannot read properties of null (reading '0')

[Killed] ConditionalExpression
src/helpers/CalculatorOperationClasses.tsx:50:11
     }
 
     // Find all occurances of subtraction, evaluate them, then update the function
-    while(functionString.match(/\-?[0-9]+\.?[0-9]*\-\-?[0-9]+\.?[0-9]*/) !== null) {
+    while(false) {
         // Notice that because we are dealing with subtraction now, the result could be negative. We must handle that in the Regex
         let subAppearance = functionString.match(/\-?[0-9]+\.?[0-9]*\-\-?[0-9]+\.?[0-9]*/)![0];
killedBy: CalculatorHelper should do basic calculations correctly should return the calculated number for valid operator with function '5-2'
statusReason: expected 'Error' to deeply equal 3

[Killed] Regex
src/helpers/CalculatorOperationClasses.tsx:52:50
     // Find all occurances of subtraction, evaluate them, then update the function
     while(functionString.match(/\-?[0-9]+\.?[0-9]*\-\-?[0-9]+\.?[0-9]*/) !== null) {
         // Notice that because we are dealing with subtraction now, the result could be negative. We must handle that in the Regex
-        let subAppearance = functionString.match(/\-?[0-9]+\.?[0-9]*\-\-?[0-9]+\.?[0-9]*/)![0];
+        let subAppearance = functionString.match(/\-?[0-9]+\.?[0-9]*\-\-?[0-9]+\.?[^0-9]*/)![0];
         let operators = subAppearance.split('-');
killedBy: CalculatorHelper should do basic calculations correctly should return the calculated number for valid operator with function '5.7-6.8'
statusReason: expected -0.2999999999999999 to deeply equal -1.0999999999999996

[Killed] StringLiteral
src/helpers/CalculatorOperationClasses.tsx:54:45
         // Notice that because we are dealing with subtraction now, the result could be negative. We must handle that in the Regex
         let subAppearance = functionString.match(/\-?[0-9]+\.?[0-9]*\-\-?[0-9]+\.?[0-9]*/)![0];
-        let operators = subAppearance.split('-');
+        let operators = subAppearance.split("");
         let operator1: number;
         let operator2: number;
killedBy: CalculatorHelper should do basic calculations correctly should return the calculated number for valid operator with function '5-2'
statusReason: expected 7 to deeply equal 3

[Killed] ConditionalExpression
src/helpers/CalculatorOperationClasses.tsx:59:12
         let operator2: number;
 
         // Both nums positive
-        if(operators.length == 2) {
+        if(true) {
             operator1 = (+operators[0]);
             operator2 = (+operators[1]);
killedBy: CalculatorHelper should do complex calculations correctly should return the calculated number for valid operator with function '5-2-4-6'
statusReason: expected -1 to deeply equal -7

[Killed] EqualityOperator
src/helpers/CalculatorOperationClasses.tsx:59:12
         let operator2: number;
 
         // Both nums positive
-        if(operators.length == 2) {
+        if(operators.length != 2) {
             operator1 = (+operators[0]);
             operator2 = (+operators[1]);
killedBy: App should calculate correctly should perform subtraction correctly
statusReason: expected 'Error' to deeply equal '6'

[Killed] UnaryOperator
src/helpers/CalculatorOperationClasses.tsx:60:26
 
         // Both nums positive
         if(operators.length == 2) {
-            operator1 = (+operators[0]);
+            operator1 = (-operators[0]);
             operator2 = (+operators[1]);
         } else {
killedBy: CalculatorHelper should do basic calculations correctly should return the calculated number for valid operator with function '5-2'
statusReason: expected -7 to deeply equal 3

[Killed] UnaryOperator
src/helpers/CalculatorOperationClasses.tsx:61:26
         // Both nums positive
         if(operators.length == 2) {
             operator1 = (+operators[0]);
-            operator2 = (+operators[1]);
+            operator2 = (-operators[1]);
         } else {
             // First num negative
killedBy: App should calculate correctly should perform subtraction correctly
statusReason: expected '10' to deeply equal '6'

[Killed] BlockStatement
src/helpers/CalculatorOperationClasses.tsx:62:16
         if(operators.length == 2) {
             operator1 = (+operators[0]);
             operator2 = (+operators[1]);
-        } else {
-            // First num negative
-            if(operators[0] == '') {
-                operator1 = -1 * (+operators[1]);
-                operator2 = (+operators[2]);
-            // Second num negative
-            } else {
-                operator1 = (+operators[0]);
-                operator2 = -1 * (+operators[2]);
-            }
-        }
+        } else {}
         let result: number = operator1 - operator2;
         functionString = functionString.replace(subAppearance, result.toString());
killedBy: CalculatorHelper should do complex calculations correctly should return the calculated number for valid operator with function '5-2-4-6'
statusReason: expected 'Error' to deeply equal -7

[Killed] EqualityOperator
src/helpers/CalculatorOperationClasses.tsx:64:16
             operator2 = (+operators[1]);
         } else {
             // First num negative
-            if(operators[0] == '') {
+            if(operators[0] != '') {
                 operator1 = -1 * (+operators[1]);
                 operator2 = (+operators[2]);
killedBy: CalculatorHelper should do complex calculations correctly should return the calculated number for valid operator with function '5-2-4-6'
statusReason: expected 6 to deeply equal -7

[Killed] ConditionalExpression
src/helpers/CalculatorOperationClasses.tsx:64:16
             operator2 = (+operators[1]);
         } else {
             // First num negative
-            if(operators[0] == '') {
+            if(true) {
                 operator1 = -1 * (+operators[1]);
                 operator2 = (+operators[2]);
killedBy: CalculatorHelper should do complex calculations correctly should return the calculated number for valid operator with function '6+5--3--3'
statusReason: expected -3 to deeply equal 17

[Killed] UnaryOperator
src/helpers/CalculatorOperationClasses.tsx:65:29
         } else {
             // First num negative
             if(operators[0] == '') {
-                operator1 = -1 * (+operators[1]);
+                operator1 = +1 * (+operators[1]);
                 operator2 = (+operators[2]);
             // Second num negative
killedBy: CalculatorHelper should do complex calculations correctly should return the calculated number for valid operator with function '5-2-4-6'
statusReason: expected -5 to deeply equal -7

[Killed] UnaryOperator
src/helpers/CalculatorOperationClasses.tsx:65:35
         } else {
             // First num negative
             if(operators[0] == '') {
-                operator1 = -1 * (+operators[1]);
+                operator1 = -1 * (-operators[1]);
                 operator2 = (+operators[2]);
             // Second num negative
killedBy: CalculatorHelper should do complex calculations correctly should return the calculated number for valid operator with function '5-2-4-6'
statusReason: expected -5 to deeply equal -7

[Killed] UnaryOperator
src/helpers/CalculatorOperationClasses.tsx:66:30
             // First num negative
             if(operators[0] == '') {
                 operator1 = -1 * (+operators[1]);
-                operator2 = (+operators[2]);
+                operator2 = (-operators[2]);
             // Second num negative
             } else {
killedBy: CalculatorHelper should do complex calculations correctly should return the calculated number for valid operator with function '5-2-4-6'
statusReason: expected 5 to deeply equal -7

[Killed] BlockStatement
src/helpers/CalculatorOperationClasses.tsx:68:20
                 operator1 = -1 * (+operators[1]);
                 operator2 = (+operators[2]);
             // Second num negative
-            } else {
-                operator1 = (+operators[0]);
-                operator2 = -1 * (+operators[2]);
-            }
+            } else {}
         }
         let result: number = operator1 - operator2;
killedBy: CalculatorHelper should do complex calculations correctly should return the calculated number for valid operator with function '6+5--3--3'
statusReason: expected 'Error' to deeply equal 17

[Killed] UnaryOperator
src/helpers/CalculatorOperationClasses.tsx:69:30
                 operator2 = (+operators[2]);
             // Second num negative
             } else {
-                operator1 = (+operators[0]);
+                operator1 = (-operators[0]);
                 operator2 = -1 * (+operators[2]);
             }
killedBy: CalculatorHelper should do complex calculations correctly should return the calculated number for valid operator with function '6+5--3--3'
statusReason: expected -8 to deeply equal 17

[Killed] UnaryOperator
src/helpers/CalculatorOperationClasses.tsx:70:35
             // Second num negative
             } else {
                 operator1 = (+operators[0]);
-                operator2 = -1 * (+operators[2]);
+                operator2 = -1 * (-operators[2]);
             }
         }
killedBy: CalculatorHelper should do complex calculations correctly should return the calculated number for valid operator with function '6+5--3--3'
statusReason: expected 5 to deeply equal 17

[Killed] UnaryOperator
src/helpers/CalculatorOperationClasses.tsx:70:29
             // Second num negative
             } else {
                 operator1 = (+operators[0]);
-                operator2 = -1 * (+operators[2]);
+                operator2 = +1 * (+operators[2]);
             }
         }
killedBy: CalculatorHelper should do complex calculations correctly should return the calculated number for valid operator with function '6+5--3--3'
statusReason: expected 5 to deeply equal 17

[Killed] ArithmeticOperator
src/helpers/CalculatorOperationClasses.tsx:73:30
                 operator2 = -1 * (+operators[2]);
             }
         }
-        let result: number = operator1 - operator2;
+        let result: number = operator1 + operator2;
         functionString = functionString.replace(subAppearance, result.toString());
     }
killedBy: App should calculate correctly should perform subtraction correctly
statusReason: expected '10' to deeply equal '6'

[Killed] ConditionalExpression
src/helpers/CalculatorOperationClasses.tsx:78:8
     }
 
     // Parse the result to int and return
-    if(Number.isNaN(+functionString)) {
+    if(false) {
         return 'Error';
     }
killedBy: CalculatorHelper should handle error cases correctly should return Error when starting with operator with function '1++3'
statusReason: expected NaN to deeply equal 'Error'
