[Killed] BlockStatement
src/helpers/CalculatorOperationClasses.tsx:78:39
     }
 
     // Parse the result to int and return
-    if(Number.isNaN(+functionString)) {
-        return 'Error';
-    }
+    if(Number.isNaN(+functionString)) {}
     return +functionString;
 }
killedBy: CalculatorHelper should handle error cases correctly should return Error when starting with operator with function '1++3'
statusReason: expected NaN to deeply equal 'Error'

[Killed] UnaryOperator
src/helpers/CalculatorOperationClasses.tsx:81:12
     if(Number.isNaN(+functionString)) {
         return 'Error';
     }
-    return +functionString;
+    return -functionString;
 }
killedBy: CalculatorHelper should do basic calculations correctly should return the calculated number for valid operator with function '0'
statusReason: expected -0 to deeply equal +0
